Ci4/app/Models/QuizModel.php

SELECT COUNT(*) AS `numrows`
FROM `quiz_questions`
WHERE `user_id` = 6
---
    function getNumRows(): int|string
     {
         //if a user is logged in, then fetch their credentials
         if (auth()->loggedIn())
         {
             $db = \Config\Database::connect();
             $this->user = auth()->user()->username; //fetch the username from shield auth()
             $this->user_id = auth()->id(); //fetch the user_id from shield auth()

             $this->builder = $db->table('quiz_questions');
             $this->builder->select('*');
             $this->builder->where('user_id', $this->user_id);

             // Get the total number of rows in that section of the table
             return $this->builder->countAllResults();

SELECT `quizID`, `user_id`, `user`, `question`, `choice1`, `choice2`, `choice3`, `choice4`, `answer`
FROM `quiz_questions`
WHERE `user` = 'Mr.Doe'
ORDER BY `quizID`
---
    function getQuestions(): array
    {
        $db = \Config\Database::connect();

        //use this service before using $this->request
        $this->request = \Config\Services::request();

        //use this service before using $this->>session
        $this->session = \Config\Services::session();
        $user = $this->session->get('teacher');

        $this->builder = $db->table('quiz_questions');
        $this->builder->select('quizID,user_id,user,question,choice1,choice2,choice3,choice4,answer');
        $this->builder->where('user', $user);
        $this->builder->orderBy('quizID');
        return $this->builder->get()->getResultArray();

SELECT `quizID`, `user`, `question`, `choice1`, `choice2`, `choice3`, `choice4`, `answer`
FROM `quiz_questions`
WHERE `user_id` = 2
ORDER BY `quizID` ASC
---
    function get_quiz()
    {
        $db = \Config\Database::connect();

        // get the logged in users id from shield auth()
        //$user_id = auth()->id();

        //if a user is logged in, then fetch their credentials
        if (auth()->loggedIn())
        {
            $this->user = auth()->user()->username; //fetch the username from shield auth()
            $this->user_id = auth()->id(); //fetch the user_id from shield auth()

            $this->builder = $db->table('quiz_questions');
            $this->builder->select('quizID,user,question,choice1,choice2,choice3,choice4,answer');
            $this->builder->where('user_id', $this->user_id);
            $this->builder->orderBy('quizID' ,'ASC'); //only fetch the question from the logged in us
            return $this->builder->get();

SELECT `quizID`, `user_id`, `user`, `question`, `choice1`, `choice2`, `choice3`, `choice4`, `answer`
FROM `quiz_questions`
WHERE `user` = 'Mr.Doe'
ORDER BY `quizID`
---
    function get_teachers_quiz(): bool|array|\CodeIgniter\Database\ResultInterface
    {
        $db = \Config\Database::connect();

        //use this service before using $this->request
        $this->request = \Config\Services::request();

        //use this service before using $this->>session
        $this->session = \Config\Services::session();
        $user = $this->request->getPost('teacher'); //gets the value posted from the dropdown

        // place username from the search form into session
        $this->session->set('teacher', $user);


        $this->builder = $db->table('quiz_questions');
        $this->builder->select('quizID,user_id,user,question,choice1,choice2,choice3,choice4,answer');
        $this->builder->where('user', $user);
        $this->builder->orderBy('quizID');
        return $this->builder->get()->getResultArray(); //this solved the problem about object vs array ?

SELECT DISTINCT `user`
FROM `quiz_questions`
ORDER BY `user` ASC
---
    function get_teachers_names(): bool|array|\CodeIgniter\Database\ResultInterface
    {
        $db = \Config\Database::connect();

        //use this service before using $this->request
        $this->request = \Config\Services::request();

        //use this service before using $this->>session
        $this->session = \Config\Services::session();

        $this->builder = $db->table('quiz_questions');

        $this->builder->select('user');
        $this->builder->distinct(); //fetches a distinct name only, notice the order here!
        $this->builder->orderBy('user','ASC');
        return $this->builder->get()->getResultArray(); //this solved the problem about object vs array ?

SELECT *
FROM `quiz_questions`
WHERE `quizID` = '9'
---
    function get_where($quizID): bool|string|\CodeIgniter\Database\ResultInterface
    {
        //use this service when you need to use it
        //$request = \Config\Services::request();

        $db = \Config\Database::connect();
        $this->builder = $db->table('quiz_questions');
        $this->builder->select('*');
        // grabs the quiz_id for the record to be edited
        $this->builder->where('quizID', $quizID);
        return $this->builder->get();