Ci4/app/Models/ResultModel.php

    function get_results(): bool|string|\CodeIgniter\Database\ResultInterface
    {
        $db = \Config\Database::connect();

        // get the logged in users id from shield auth()
        $user = auth()->user()->username;

        $this->builder = $db->table('quiz_results');
        $this->builder->select('result_id,user,quiz_taker,class,your_answer1,your_answer2,your_answer3,your_answer4,final,date_taken');
        // get the logged in users id from shield auth()
        $this->builder->where('user', $user);
        $this->builder->orderBy('result_id');
        return $this->builder->get();
---
SELECT `result_id`, `user`, `quiz_taker`, `class`, `your_answer1`, `your_answer2`, `your_answer3`, `your_answer4`, `final`, `date_taken`
FROM `quiz_results`
WHERE `user` = 'Mr.Doe'
ORDER BY `result_id`