Ci4/app/Controllers/Quiz.php

INSERT INTO `quiz_questions` (`question`, `choice1`, `choice2`, `choice3`, `choice4`, `answer`, `user_id`, `user`) VALUES ('What is largest desert in the world?', 'Kalahari', 'Namib', 'Egypt', 'Antartic', 'Antartic', 6, 'Mr.Doe')
---
        // Instantiate the model to use
        $model = model(QuizModel::class);
        // Save validated post data to the database
        $model->save([
            'question' => $posts['question'],
            'choice1' => $posts['choice1'],
            'choice2' => $posts['choice2'],
            'choice3' => $posts['choice3'],
            'choice4' => $posts['choice4'],
            'answer' => $posts['answer'],
            'user_id' => $this->user_id,
            'user' => $this->user
        ]);

INSERT INTO `quiz_results` (`quiz_taker`, `class`, `your_answer1`, `your_answer2`, `your_answer3`, `your_answer4`, `final`, `user`) VALUES ('Mary Poppins', '2G', 'Canberra', 'Mars', 'H20', 'Antartic', 5, 'Mr.Doe')
---
    public function submit_results(): \CodeIgniter\HTTP\ResponseInterface|string
    {
        $posted_data = $this->request->getPost(['quiz_taker', 'class', 'your_answer1',
            'your_answer2', 'your_answer3', 'your_answer4', 'final']);

        // Checks whether the submitted data passed the validation rules.
        if (!$this->validateData($posted_data, [

            'quiz_taker' => [
                'label' => 'Name',
                'rules' => 'required|min_length[4]|max_length[52]'
            ],
            'class' => [
                'label' => 'Section',
                'rules' => 'required|max_length[52]'
            ],
            // no rules required when retrieving a values from session
        ])) {
            // When the validation fails, return the form and show error messages if they exist..
            return $this->submit_results_form();
        }
        // Get the validated data that was posted.
        $posts = $this->validator->getValidated();
        // instantiate the model to use
        $model = model(ResultModel::class);
        // Save validated post data to the database
        $model->save([
            'quiz_taker' => $posts['quiz_taker'],
            'class' => $posts['class'],
            'your_answer1' => $this->session->get('your_answer1'),
            'your_answer2' => $this->session->get('your_answer2'),
            'your_answer3' => $this->session->get('your_answer3'),
            'your_answer4' => $this->session->get('your_answer4'),
            'final' => $this->session->get('score'),
            'user' => $this->session->get('teacher'), //session from the dropdown form
        ]);